tutorials/CFD/mydeim (1ppe correction+2pimple loop and pressure-velocity reconstruction)/lift/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;
debug 0;
mergeTolerance 1e-6;


geometry
{
    cylinder1
    {
        type searchableCylinder;
        point1 (0 0 -2.5);    // Height
        point2 (0 0 2.5);    // Vector
        radius 0.5; 
    }

/*    cylinder2*/
/*    {*/
/*        type searchableCylinder;*/
/*        point1 (9 0 -2.5);    // Height*/
/*        point2 (9 0 2.5);    // Vector*/
/*        radius 0.5; */
/*    }*/

    refinementBox                      //USER DEFINED REGION NAME
    {
          type searchableBox;          //REGION DEFINED BY BOUNDING BOX
          min ( -1 -1 -3);    //parameters
          max (3 1 3);    
    }

    suprefinementBox1                      //USER DEFINED REGION NAME
    {
          type searchableBox;          //REGION DEFINED BY BOUNDING BOX
          min ( -1 -1 -6);    //parameters
          max (1 1 6);    
    }  

/*    suprefinementBox2                      //USER DEFINED REGION NAME*/
/*    {*/
/*          type searchableBox;          //REGION DEFINED BY BOUNDING BOX*/
/*          min (8 -1 -6);    //parameters*/
/*          max (10 1 6);    */
/*    }      */

    suprefinementCylinder1
    {
        type searchableCylinder;
        point1 (0 0 -2.7);    // Height
        point2 (0 0 2.7);    // Vector
        radius 0.8; 
    }

/*    suprefinementCylinder2*/
/*    {*/
/*        type searchableCylinder;*/
/*        point1 (9 0 -2.7);    // Height*/
/*        point2 (9 0 2.7);    // Vector*/
/*        radius 0.8; */
/*    }*/
};
castellatedMeshControls
{
    maxLocalCells 3000000;
    maxGlobalCells 5000000;
    minRefinementCells 50;
    //maxLoadUnbalance 0.50;
    nCellsBetweenLevels 6;
    features
    (
    );
    refinementSurfaces
    {  
        cylinder1
        {
            level (5 6);

            patchInfo
            {
                type wall;
            }
        }
        
    }
    refinementSurfaces
    {  
        cylinder2
        {
            level (5 6);

            patchInfo
            {
                type wall;
            }
        }
        
    }

    resolveFeatureAngle 30;
/*    refinementRegions*/
/*    {*/
/*    	cylinder*/
/*    	{*/
/*    		mode distance;*/
/*    		levels ((0.01 5) (0.2 2) (1 1));*/
/*    	}*/
/*    }*/

    refinementRegions
    {
      
       refinementBox
        {
            mode inside;
            levels ((2 2));
        }
       suprefinementBox1
        {
            mode inside;
            levels ((3 3));
        }
/*       suprefinementBox2*/
/*        {*/
/*            mode inside;*/
/*            levels ((3 3));*/
/*        }*/
       
        suprefinementCylinder1
        {
            mode inside;
            levels ((4 4));
        }

/*        suprefinementCylinder2*/
/*        {*/
/*            mode inside;*/
/*            levels ((4 4));*/
/*        }*/
    }
    
    
    locationInMesh (8 0 0);
    allowFreeStandingZoneFaces true;
}


snapControls
{
    nSmoothPatch 5;
    tolerance 1.0;
    nSolveIter 300;
    nRelaxIter 5;
}

addLayersControls
{
    relativeSizes false;

    layers
    {
        cylinder1
        {
            nSurfaceLayers 40;
        }
    }

    layers
    {
        cylinder2
        {
            nSurfaceLayers 40;
        }
    }

    expansionRatio 1.2;
//    finalLayerThickness 1e-9;
    finalLayerThickness 0.015e-7;
  //  finalLayerRatio 0.01;
    minThickness 0.001e-7;
    nGrow 0;
    featureAngle 30;
    nRelaxIter 10;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.8;
    maxThicknessToMedialRatio 0.8;
    minMedianAxisAngle 40;
    nBufferCellsNoExtrude 0;
    nLayerIter 100;
    nRelaxedIter 20;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-250;
    minTetQuality 1e-25;
    minArea -1;
    minTwist 0.05;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 1e-1;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}



// ************************************************************************* //
